// 高宗純皇帝實錄 Hung Li

jdata = [{
    "k1": "高其倬",
    "kg2": [{
        "v": 1,
        "k2": "高焜",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 2,
        "k2": "高恪",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 4,
        "k2": "風水",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 48
  },
  {
    "k1": "史貽直",
    "kg2": [{
        "v": 1,
        "k2": "史奕簪",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 6,
        "k2": "史奕昂",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "史奕瓌",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 181
  },
  {
    "k1": "王昶",
    "kg2": [{
        "v": 2,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "紀昀",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 2,
        "k2": "溫福",
        "gp": 2,
        "type": [
          "長官"
        ]
      },
      {
        "v": 8,
        "k2": "阿桂",
        "gp": 2,
        "type": [
          "長官"
        ]
      },
      {
        "v": 2,
        "k2": "盧見曾",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 7,
        "k2": "畢沅",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 2,
        "k2": "趙文哲",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "翁方綱",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "陸錫熊",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "錢大昕",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 44
  },
  {
    "k1": "錢陳群",
    "kg2": [{
        "v": 13,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "錢汝誠",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "錢金殿",
        "gp": 2,
        "type": [
          "堂弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 63
  },
  {
    "k1": "王師",
    "kg2": [{
      "v": 3,
      "k2": "王亶望",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 90
  },
  {
    "k1": "長庚",
    "kg2": [{
      "v": 1,
      "k2": "穆爾泰",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 34
  },
  {
    "k1": "魏定國",
    "kg2": [{
      "v": 1,
      "k2": "魏允迪",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 42
  },
  {
    "k1": "劉文",
    "kg2": [{
      "v": 1,
      "k2": "劉藻",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 32
  },
  {
    "k1": "李元亮",
    "kg2": [{
      "v": 5,
      "k2": "李侍堯",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 46
  },
  {
    "k1": "周人驥",
    "kg2": [{
      "v": 6,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 67
  },
  {
    "k1": "范時綬",
    "kg2": [{
      "v": 1,
      "k2": "范時紀",
      "gp": 2,
      "type": [
        "堂兄弟"
      ]
    }],
    "gp": 1,
    "idf": 89
  },
  {
    "k1": "張廷玉",
    "kg2": [{
        "v": 8,
        "k2": "張若靄",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "張廷瑑",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 3,
        "k2": "張若澄",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "張若渟",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "張英",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 205
  },
  {
    "k1": "蔡世遠",
    "kg2": [{
        "v": 1,
        "k2": "蔡新",
        "gp": 2,
        "type": [
          "族侄"
        ]
      },
      {
        "v": 1,
        "k2": "蔡長澐",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "福保",
    "kg2": [{
        "v": 1,
        "k2": "二格",
        "gp": 2,
        "type": [
          "曾祖"
        ]
      },
      {
        "v": 1,
        "k2": "六十三",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 30
  },
  {
    "k1": "裴度",
    "kg2": [{
      "v": 1,
      "k2": "裴度",
      "gp": 2,
      "type": [
        "三十世祖"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "甘汝來",
    "kg2": [{
      "v": 1,
      "k2": "甘顯祖",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 22
  },
  {
    "k1": "王太岳",
    "kg2": [{
        "v": 2,
        "k2": "鄭虎文",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 4,
        "k2": "顧汝修",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 4,
        "k2": "邵齊燾",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "周玉",
    "kg2": [{
      "v": 4,
      "k2": "周禮",
      "gp": 2,
      "type": [
        "曾祖父"
      ]
    }],
    "gp": 1,
    "idf": 13
  },
  {
    "k1": "黃檢",
    "kg2": [{
        "v": 8,
        "k2": "黃廷桂",
        "gp": 2,
        "type": [
          "祖父"
        ]
      },
      {
        "v": 1,
        "k2": "黃模",
        "gp": 2,
        "type": [
          "兄弟"
        ]
      },
      {
        "v": 1,
        "k2": "黃栻",
        "gp": 2,
        "type": [
          "兄弟"
        ]
      },
      {
        "v": 1,
        "k2": "黃文燝",
        "gp": 2,
        "type": [
          "族侄"
        ]
      },
      {
        "v": 1,
        "k2": "李亨特",
        "gp": 2,
        "type": [
          "妹夫"
        ]
      }
    ],
    "gp": 1,
    "idf": 45
  },
  {
    "k1": "尹會一",
    "kg2": [{
      "v": 3,
      "k2": "尹嘉銓",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 92
  },
  {
    "k1": "白映棠",
    "kg2": [{
      "v": 1,
      "k2": "白璜",
      "gp": 2,
      "type": [
        "堂叔"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "錢載",
    "kg2": [{
        "v": 2,
        "k2": "錢汝誠",
        "gp": 2,
        "type": [
          "從父"
        ]
      },
      {
        "v": 1,
        "k2": "蔣溥",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 28
  },
  {
    "k1": "嵇璜",
    "kg2": [{
        "v": 3,
        "k2": "嵇承豫",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "嵇曾筠",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "嵇璇",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "嵇承群",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 228
  },
  {
    "k1": "謝振定",
    "kg2": [{
        "v": 1,
        "k2": "秦瀛",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "法式善",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "藍廷珍",
    "kg2": [{
        "v": 5,
        "k2": "藍元枚",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 3,
        "k2": "藍鼎元",
        "gp": 2,
        "type": [
          "族弟,策士"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "劉綸",
    "kg2": [{
        "v": 28,
        "k2": "劉統勳",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 13,
        "k2": "于敏中",
        "gp": 2,
        "type": [
          "姻婭"
        ]
      },
      {
        "v": 16,
        "k2": "尹繼善",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 5,
        "k2": "張廷玉",
        "gp": 2,
        "type": [
          "師,博學鴻詞閱卷官"
        ]
      },
      {
        "v": 6,
        "k2": "汪由敦",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 3,
        "k2": "鄂爾泰",
        "gp": 2,
        "type": [
          "博學鴻詞閱卷官"
        ]
      }
    ],
    "gp": 1,
    "idf": 106
  },
  {
    "k1": "林儁",
    "kg2": [{
      "v": 1,
      "k2": "林國泰",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "方苞",
    "kg2": [{
        "v": 2,
        "k2": "陳大受",
        "gp": 2,
        "type": [
          "學生"
        ]
      },
      {
        "v": 1,
        "k2": "雷鋐",
        "gp": 2,
        "type": [
          "學生"
        ]
      },
      {
        "v": 2,
        "k2": "楊名時",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "陳浩",
        "gp": 2,
        "type": [
          "學生"
        ]
      },
      {
        "v": 3,
        "k2": "朱軾",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "李紱",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 3,
        "k2": "尹會一",
        "gp": 2,
        "type": [
          "學生"
        ]
      }
    ],
    "gp": 1,
    "idf": 25
  },
  {
    "k1": "施學濂",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "胡季堂",
    "kg2": [{
      "v": 2,
      "k2": "胡煦",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 95
  },
  {
    "k1": "李元直",
    "kg2": [{
      "v": 1,
      "k2": "陳宏謀",
      "gp": 2,
      "type": [
        "薦舉者"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "陳蘭森",
    "kg2": [{
      "v": 3,
      "k2": "陳宏謀",
      "gp": 2,
      "type": [
        "祖"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "錢維城",
    "kg2": [{
        "v": 15,
        "k2": "師",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 6,
        "k2": "董邦達",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 1,
        "k2": "錢中銑",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 56
  },
  {
    "k1": "劉鐶之",
    "kg2": [{
      "v": 1,
      "k2": "劉統勳",
      "gp": 2,
      "type": [
        "祖"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "陳世倌",
    "kg2": [{
      "v": 3,
      "k2": "陳元龍",
      "gp": 2,
      "type": [
        "堂叔"
      ]
    }],
    "gp": 1,
    "idf": 98
  },
  {
    "k1": "覺羅倫達禮",
    "kg2": [{
        "v": 1,
        "k2": "瓜爾佳氏",
        "gp": 2,
        "type": [
          "嫡母,阿爾泰之女"
        ]
      },
      {
        "v": 1,
        "k2": "張氏",
        "gp": 2,
        "type": [
          "妾,張大之女"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "馬士英",
    "kg2": [{
      "v": 1,
      "k2": "楊文驄",
      "gp": 2,
      "type": [
        "戚"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "倪元璐",
    "kg2": [{
        "v": 1,
        "k2": "易",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "黃道周",
        "gp": 2,
        "type": [
          "同年"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "裴宗錫",
    "kg2": [{
      "v": 2,
      "k2": "裴正文",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 133
  },
  {
    "k1": "林洛",
    "kg2": [{
      "v": 3,
      "k2": "林輔國",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "勵宗萬",
    "kg2": [{
        "v": 2,
        "k2": "邱玖華",
        "gp": 2,
        "type": [
          "門生"
        ]
      },
      {
        "v": 1,
        "k2": "勵宗奕",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "勵守謙",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 36
  },
  {
    "k1": "王應綵",
    "kg2": [{
      "v": 1,
      "k2": "王應綸",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "鄭華",
    "kg2": [{
      "v": 3,
      "k2": "鄭昭",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "德敏",
    "kg2": [{
      "v": 1,
      "k2": "順昌",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 36
  },
  {
    "k1": "夏之蓉",
    "kg2": [{
      "v": 2,
      "k2": "夏廷芝",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "周濤",
    "kg2": [{
        "v": 1,
        "k2": "周濤",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "周濤",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "年羹堯",
    "kg2": [{
        "v": 1,
        "k2": "張廷玉",
        "gp": 2,
        "type": [
          "同年"
        ]
      },
      {
        "v": 1,
        "k2": "曹德",
        "gp": 2,
        "type": [
          "家人"
        ]
      },
      {
        "v": 1,
        "k2": "年秀",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 4,
        "k2": "岳鍾琪",
        "gp": 2,
        "type": [
          "部屬"
        ]
      }
    ],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "蕭九成",
    "kg2": [{
      "v": 1,
      "k2": "蕭池",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "蔣洲",
    "kg2": [{
        "v": 2,
        "k2": "蔣溥",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "蔣廷錫",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 35
  },
  {
    "k1": "李世傑",
    "kg2": [{
        "v": 2,
        "k2": "李再瀛",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 2,
        "k2": "李華封",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "李華國",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 352
  },
  {
    "k1": "沈廷芳",
    "kg2": [{
      "v": 5,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 39
  },
  {
    "k1": "陳樹萱",
    "kg2": [{
        "v": 1,
        "k2": "陳鵬年",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "陳樹芳",
        "gp": 2,
        "type": [
          "族弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "高山",
    "kg2": [{
      "v": 2,
      "k2": "梁詩正",
      "gp": 2,
      "type": [
        "房生"
      ]
    }],
    "gp": 1,
    "idf": 52
  },
  {
    "k1": "李昑",
    "kg2": [{
        "v": 1,
        "k2": "李緈",
        "gp": 2,
        "type": [
          "子,孝章世子"
        ]
      },
      {
        "v": 3,
        "k2": "李愃",
        "gp": 2,
        "type": [
          "子,莊獻世子"
        ]
      },
      {
        "v": 1,
        "k2": "李倧",
        "gp": 2,
        "type": [
          "高祖,朝鮮仁祖"
        ]
      }
    ],
    "gp": 1,
    "idf": 73
  },
  {
    "k1": "崔應階",
    "kg2": [{
      "v": 2,
      "k2": "崔琇",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 237
  },
  {
    "k1": "左秀",
    "kg2": [{
        "v": 1,
        "k2": "左永",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "左貴",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "孫孝愉",
    "kg2": [{
      "v": 1,
      "k2": "孫嘉淦",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "朱由崧",
    "kg2": [{
      "v": 1,
      "k2": "朱由榔",
      "gp": 2,
      "type": [
        "堂弟"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "尚敬",
    "kg2": [{
      "v": 1,
      "k2": "尚穆",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 17
  },
  {
    "k1": "王以銜",
    "kg2": [{
        "v": 1,
        "k2": "王以鋙",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "竇光鼐",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "李鈞",
    "kg2": [{
      "v": 1,
      "k2": "曹振鏞",
      "gp": 2,
      "type": [
        "師"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "何煟",
    "kg2": [{
      "v": 1,
      "k2": "何裕城",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 141
  },
  {
    "k1": "徐績",
    "kg2": [{
      "v": 1,
      "k2": "學者",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 175
  },
  {
    "k1": "王頊齡",
    "kg2": [{
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "王鴻緒",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "安國",
    "kg2": [{
      "v": 7,
      "k2": "春秋",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 108
  },
  {
    "k1": "周氏",
    "kg2": [{
      "v": 1,
      "k2": "朱氏",
      "gp": 2,
      "type": [
        "女,重慶大長公主"
      ]
    }],
    "gp": 1,
    "idf": 47
  },
  {
    "k1": "沈德潛",
    "kg2": [{
      "v": 1,
      "k2": "沈維熙",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 43
  },
  {
    "k1": "張鵬翀",
    "kg2": [{
        "v": 2,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "胡定",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "史貽直",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "王友亮",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "高瑹",
    "kg2": [{
        "v": 2,
        "k2": "高瑋",
        "gp": 2,
        "type": [
          "堂兄"
        ]
      },
      {
        "v": 1,
        "k2": "高嵉",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "寅保",
    "kg2": [{
        "v": 1,
        "k2": "唐釗",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "唐英",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "德福",
    "kg2": [{
        "v": 1,
        "k2": "達敏",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "官福",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 183
  },
  {
    "k1": "米國正",
    "kg2": [{
      "v": 1,
      "k2": "米敏",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "胡煦",
    "kg2": [{
        "v": 2,
        "k2": "理學",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "胡季堂",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "胡孟基",
        "gp": 2,
        "type": [
          "繼子"
        ]
      }
    ],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "陳璸",
    "kg2": [{
      "v": 1,
      "k2": "陳子良",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "李時",
    "kg2": [{
      "v": 1,
      "k2": "李溥",
      "gp": 2,
      "type": [
        "祖父"
      ]
    }],
    "gp": 1,
    "idf": 63
  },
  {
    "k1": "范時紀",
    "kg2": [{
      "v": 1,
      "k2": "范時綬",
      "gp": 2,
      "type": [
        "堂兄弟"
      ]
    }],
    "gp": 1,
    "idf": 25
  },
  {
    "k1": "張若渟",
    "kg2": [{
      "v": 3,
      "k2": "張廷玉",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 25
  },
  {
    "k1": "王際華",
    "kg2": [{
      "v": 2,
      "k2": "王朝梧",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 62
  },
  {
    "k1": "蔡新",
    "kg2": [{
        "v": 1,
        "k2": "蔡世遠",
        "gp": 2,
        "type": [
          "從父"
        ]
      },
      {
        "v": 1,
        "k2": "蔡本俶",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 89
  },
  {
    "k1": "崇泰",
    "kg2": [{
      "v": 1,
      "k2": "文泰",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "王相",
    "kg2": [{
      "v": 1,
      "k2": "王杰",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "李湖",
    "kg2": [{
      "v": 1,
      "k2": "李采",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 160
  },
  {
    "k1": "高士奇",
    "kg2": [{
        "v": 3,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "文學",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 6,
        "k2": "徐乾學",
        "gp": 2,
        "type": [
          "姻親"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "孫嘉淦",
    "kg2": [{
      "v": 1,
      "k2": "孫孝愉",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 271
  },
  {
    "k1": "彭承堯",
    "kg2": [{
      "v": 1,
      "k2": "彭朝龍",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "額爾登布",
    "kg2": [{
      "v": 1,
      "k2": "德克進布",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 17
  },
  {
    "k1": "戴璐",
    "kg2": [{
        "v": 1,
        "k2": "費淳",
        "gp": 2,
        "type": [
          "同年"
        ]
      },
      {
        "v": 1,
        "k2": "姚鼐",
        "gp": 2,
        "type": [
          "同年"
        ]
      },
      {
        "v": 1,
        "k2": "董誥",
        "gp": 2,
        "type": [
          "同年"
        ]
      }
    ],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "王安國",
    "kg2": [{
        "v": 1,
        "k2": "王念孫",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王曾祿",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 88
  },
  {
    "k1": "郭氏",
    "kg2": [{
        "v": 2,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,永嘉公主"
        ]
      },
      {
        "v": 2,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,汝陽公主"
        ]
      }
    ],
    "gp": 1,
    "idf": 53
  },
  {
    "k1": "鄂善",
    "kg2": [{
      "v": 1,
      "k2": "清彥",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 43
  },
  {
    "k1": "文祿",
    "kg2": [{
      "v": 1,
      "k2": "文光",
      "gp": 2,
      "type": [
        "女婿"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "陳大用",
    "kg2": [{
        "v": 1,
        "k2": "陳益",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "陳福",
        "gp": 2,
        "type": [
          "曾祖"
        ]
      }
    ],
    "gp": 1,
    "idf": 36
  },
  {
    "k1": "李永芳",
    "kg2": [{
        "v": 3,
        "k2": "李侍堯",
        "gp": 2,
        "type": [
          "四世孫"
        ]
      },
      {
        "v": 1,
        "k2": "巴顏",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "張照",
    "kg2": [{
        "v": 1,
        "k2": "音樂",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "張應田",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "張彙義",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 68
  },
  {
    "k1": "林文",
    "kg2": [{
      "v": 1,
      "k2": "文學",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "朱由榔",
    "kg2": [{
      "v": 1,
      "k2": "朱由崧",
      "gp": 2,
      "type": [
        "堂兄"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "汪氏",
    "kg2": [{
      "v": 1,
      "k2": "朱氏",
      "gp": 2,
      "type": [
        "女,固安郡主"
      ]
    }],
    "gp": 1,
    "idf": 17
  },
  {
    "k1": "來復",
    "kg2": [{
      "v": 1,
      "k2": "劍",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 35
  },
  {
    "k1": "彭肇洙",
    "kg2": [{
      "v": 1,
      "k2": "彭端淑",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "王鳴盛",
    "kg2": [{
      "v": 3,
      "k2": "錢大昕",
      "gp": 2,
      "type": [
        "妹婿"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "彭樹葵",
    "kg2": [{
      "v": 4,
      "k2": "蔡新",
      "gp": 2,
      "type": [
        "同年"
      ]
    }],
    "gp": 1,
    "idf": 42
  },
  {
    "k1": "于敏中",
    "kg2": [{
        "v": 2,
        "k2": "于枋",
        "gp": 2,
        "type": [
          "嗣父"
        ]
      },
      {
        "v": 7,
        "k2": "于德裕",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 6,
        "k2": "于時和",
        "gp": 2,
        "type": [
          "姪"
        ]
      },
      {
        "v": 7,
        "k2": "于易簡",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "于齊賢",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "孔憲培",
        "gp": 2,
        "type": [
          "婿"
        ]
      }
    ],
    "gp": 1,
    "idf": 131
  },
  {
    "k1": "褚廷璋",
    "kg2": [{
      "v": 2,
      "k2": "曹仁虎",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 20
  },
  {
    "k1": "程晉芳",
    "kg2": [{
      "v": 1,
      "k2": "戴震",
      "gp": 2,
      "type": [
        "師"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "王鴻緒",
    "kg2": [{
      "v": 1,
      "k2": "王頊齡",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "楊贊",
    "kg2": [{
      "v": 1,
      "k2": "阿里袞",
      "gp": 2,
      "type": [
        "保送者"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "紀昀",
    "kg2": [{
        "v": 5,
        "k2": "朱珪",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 4,
        "k2": "錢大昕",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 4,
        "k2": "朱筠",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 7,
        "k2": "王杰",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 3,
        "k2": "王鳴盛",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 3,
        "k2": "王昶",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 8,
        "k2": "彭元瑞",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 86
  },
  {
    "k1": "陳悳華",
    "kg2": [{
      "v": 3,
      "k2": "陳悳正",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 53
  },
  {
    "k1": "劉鳳誥",
    "kg2": [{
        "v": 3,
        "k2": "劉鐶之",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 5,
        "k2": "阮元",
        "gp": 2,
        "type": [
          "同年友"
        ]
      },
      {
        "v": 1,
        "k2": "彭元瑞",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "李亨特",
    "kg2": [{
      "v": 1,
      "k2": "李奉翰",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "趙曰泌",
    "kg2": [{
      "v": 1,
      "k2": "趙良棟",
      "gp": 2,
      "type": [
        "五世祖"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "劉文炳",
    "kg2": [{
      "v": 1,
      "k2": "鞏永固",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "魏廷珍",
    "kg2": [{
      "v": 1,
      "k2": "魏錫麟",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "丹巴多爾濟",
    "kg2": [{
      "v": 14,
      "k2": "扎拉豐阿",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 42
  },
  {
    "k1": "方維甸",
    "kg2": [{
      "v": 1,
      "k2": "方觀承",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "黃秉淳",
    "kg2": [{
      "v": 8,
      "k2": "黃仕簡",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "岳鍾琪",
    "kg2": [{
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 5,
        "k2": "岳鍾璜",
        "gp": 2,
        "type": [
          "堂弟"
        ]
      },
      {
        "v": 9,
        "k2": "岳濬",
        "gp": 2,
        "type": [
          "長子"
        ]
      },
      {
        "v": 1,
        "k2": "岳淓",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "岳沺",
        "gp": 2,
        "type": [
          "次子"
        ]
      },
      {
        "v": 1,
        "k2": "岳廷極",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 167
  },
  {
    "k1": "何國宗",
    "kg2": [{
      "v": 2,
      "k2": "何國棟",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "吳熊光",
    "kg2": [{
      "v": 1,
      "k2": "李世望",
      "gp": 2,
      "type": [
        "親家"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "閔鶚元",
    "kg2": [{
        "v": 1,
        "k2": "閔思敬",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "閔思毅",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 6,
        "k2": "閔鵷元",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 313
  },
  {
    "k1": "徐乾學",
    "kg2": [{
      "v": 6,
      "k2": "高士奇",
      "gp": 2,
      "type": [
        "姻親"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "李清時",
    "kg2": [{
      "v": 1,
      "k2": "李本璿",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 43
  },
  {
    "k1": "石勇",
    "kg2": [{
      "v": 1,
      "k2": "祥泰",
      "gp": 2,
      "type": [
        "族姪"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "梁同書",
    "kg2": [{
        "v": 3,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "梁詩正",
        "gp": 2,
        "type": [
          "本生父"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "張師載",
    "kg2": [{
      "v": 1,
      "k2": "張伯行",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 180
  },
  {
    "k1": "陳宏謀",
    "kg2": [{
        "v": 41,
        "k2": "楊錫紱",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "謝溶生",
        "gp": 2,
        "type": [
          "女婿"
        ]
      },
      {
        "v": 3,
        "k2": "陳蘭森",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 2,
        "k2": "陳法",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "尹會一",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "雷鋐",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 464
  },
  {
    "k1": "陳浩",
    "kg2": [{
        "v": 1,
        "k2": "俞長庚",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "譚氏",
        "gp": 2,
        "type": [
          "母"
        ]
      }
    ],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "金甡",
    "kg2": [{
      "v": 1,
      "k2": "朱珪",
      "gp": 2,
      "type": [
        "徒"
      ]
    }],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "吳嗣爵",
    "kg2": [{
        "v": 2,
        "k2": "吳璥",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "吳瑍",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 108
  },
  {
    "k1": "尚穆",
    "kg2": [{
      "v": 1,
      "k2": "尚敬",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "江藩",
    "kg2": [{
      "v": 1,
      "k2": "經學",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 20
  },
  {
    "k1": "龍承祖",
    "kg2": [{
        "v": 1,
        "k2": "龍鳳祥",
        "gp": 2,
        "type": [
          "族姪"
        ]
      },
      {
        "v": 1,
        "k2": "龍舜琴",
        "gp": 2,
        "type": [
          "族親"
        ]
      }
    ],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "李勳",
    "kg2": [{
      "v": 1,
      "k2": "李逢堯",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "牛天畀",
    "kg2": [{
        "v": 1,
        "k2": "牛敬憲",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "牛敬一",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "劉益",
    "kg2": [{
      "v": 1,
      "k2": "劉於義",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "錢灃",
    "kg2": [{
      "v": 4,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 27
  },
  {
    "k1": "王掞",
    "kg2": [{
      "v": 1,
      "k2": "王奕清",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "喇嘛",
    "kg2": [{
      "v": 4,
      "k2": "畢里克圖",
      "gp": 2,
      "type": [
        "叔"
      ]
    }],
    "gp": 1,
    "idf": 596
  },
  {
    "k1": "尤拔世",
    "kg2": [{
        "v": 1,
        "k2": "安泰",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "安寧",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 35
  },
  {
    "k1": "馬龍圖",
    "kg2": [{
      "v": 1,
      "k2": "黃仕簡",
      "gp": 2,
      "type": [
        "姻親"
      ]
    }],
    "gp": 1,
    "idf": 18
  },
  {
    "k1": "林沁多爾濟",
    "kg2": [{
        "v": 1,
        "k2": "拉扎布",
        "gp": 2,
        "type": [
          "高祖父"
        ]
      },
      {
        "v": 1,
        "k2": "色稜",
        "gp": 2,
        "type": [
          "太曾祖父"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "孫士毅",
    "kg2": [{
        "v": 2,
        "k2": "孫均",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 1,
        "k2": "孫元",
        "gp": 2,
        "type": [
          "曾孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 493
  },
  {
    "k1": "張正興",
    "kg2": [{
      "v": 1,
      "k2": "鄂彌達",
      "gp": 2,
      "type": [
        "姻親"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "劉權之",
    "kg2": [{
      "v": 1,
      "k2": "劉校之",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 34
  },
  {
    "k1": "曹文埴",
    "kg2": [{
      "v": 1,
      "k2": "曹振鏞",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 97
  },
  {
    "k1": "趙良棟",
    "kg2": [{
      "v": 1,
      "k2": "趙曰泌",
      "gp": 2,
      "type": [
        "五世孫"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "張問陶",
    "kg2": [{
        "v": 1,
        "k2": "李賡芸",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "洪亮吉",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 1,
        "k2": "石韞玉",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "明山保",
    "kg2": [{
      "v": 1,
      "k2": "陸宏",
      "gp": 2,
      "type": [
        "家人"
      ]
    }],
    "gp": 1,
    "idf": 17
  },
  {
    "k1": "岳濬",
    "kg2": [{
        "v": 9,
        "k2": "岳鍾琪",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "岳鍾璜",
        "gp": 2,
        "type": [
          "堂叔"
        ]
      }
    ],
    "gp": 1,
    "idf": 113
  },
  {
    "k1": "李本",
    "kg2": [{
      "v": 12,
      "k2": "李侍堯",
      "gp": 2,
      "type": [
        "姪"
      ]
    }],
    "gp": 1,
    "idf": 78
  },
  {
    "k1": "徐本",
    "kg2": [{
      "v": 4,
      "k2": "徐潮",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 69
  },
  {
    "k1": "王柄",
    "kg2": [{
      "v": 4,
      "k2": "王進泰",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 26
  },
  {
    "k1": "汪由敦",
    "kg2": [{
        "v": 3,
        "k2": "汪承霈",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "汪承沆",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 89
  },
  {
    "k1": "張伯行",
    "kg2": [{
      "v": 1,
      "k2": "張師載",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "史奕簪",
    "kg2": [{
      "v": 1,
      "k2": "史貽直",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "覺羅萬福",
    "kg2": [{
      "v": 1,
      "k2": "覺羅吉慶",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "方桂",
    "kg2": [{
      "v": 1,
      "k2": "方顯",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "王奕清",
    "kg2": [{
      "v": 1,
      "k2": "王掞",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "王柔",
    "kg2": [{
      "v": 3,
      "k2": "王顯緒",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "哈峻德",
    "kg2": [{
      "v": 1,
      "k2": "哈攀龍",
      "gp": 2,
      "type": [
        "族兄"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "阿布都拉",
    "kg2": [{
      "v": 6,
      "k2": "玉素布",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 26
  },
  {
    "k1": "劉藩長",
    "kg2": [{
      "v": 1,
      "k2": "劉叔橚",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "戴第元",
    "kg2": [{
      "v": 1,
      "k2": "戴衢亨",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "方觀承",
    "kg2": [{
      "v": 1,
      "k2": "方維甸",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 816
  },
  {
    "k1": "伊星阿",
    "kg2": [{
      "v": 1,
      "k2": "祥泰",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 31
  },
  {
    "k1": "岳鍾璜",
    "kg2": [{
        "v": 5,
        "k2": "岳鍾琪",
        "gp": 2,
        "type": [
          "堂兄"
        ]
      },
      {
        "v": 1,
        "k2": "岳濬",
        "gp": 2,
        "type": [
          "姪"
        ]
      }
    ],
    "gp": 1,
    "idf": 53
  },
  {
    "k1": "陳淮",
    "kg2": [{
      "v": 2,
      "k2": "陳崇本",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 79
  },
  {
    "k1": "王顯緒",
    "kg2": [{
      "v": 3,
      "k2": "王柔",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 27
  },
  {
    "k1": "陳輝祖",
    "kg2": [{
        "v": 1,
        "k2": "申兆崙",
        "gp": 2,
        "type": [
          "妻舅"
        ]
      },
      {
        "v": 2,
        "k2": "吳以鎮",
        "gp": 2,
        "type": [
          "兒女姻親"
        ]
      },
      {
        "v": 5,
        "k2": "陳大受",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 4,
        "k2": "陳嚴祖",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "陳山崐",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "陳繩祖",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 328
  },
  {
    "k1": "曹秀先",
    "kg2": [{
      "v": 4,
      "k2": "曹詠祖",
      "gp": 2,
      "type": [
        "姪"
      ]
    }],
    "gp": 1,
    "idf": 52
  },
  {
    "k1": "羅卜藏",
    "kg2": [{
        "v": 21,
        "k2": "班第",
        "gp": 2,
        "type": [
          "曾祖"
        ]
      },
      {
        "v": 22,
        "k2": "袞布",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "諾爾布桑",
        "gp": 2,
        "type": [
          "曾孫"
        ]
      },
      {
        "v": 2,
        "k2": "垂濟扎勒",
        "gp": 2,
        "type": [
          "長子"
        ]
      }
    ],
    "gp": 1,
    "idf": 80
  },
  {
    "k1": "趙懷玉",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "張良弼",
    "kg2": [{
      "v": 1,
      "k2": "張傑",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "吳垣",
    "kg2": [{
        "v": 2,
        "k2": "吳紹詩",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "吳壇",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 39
  },
  {
    "k1": "方顯",
    "kg2": [{
      "v": 1,
      "k2": "方桂",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 33
  },
  {
    "k1": "孔廣棨",
    "kg2": [{
        "v": 1,
        "k2": "孔子",
        "gp": 2,
        "type": [
          "遠祖"
        ]
      },
      {
        "v": 2,
        "k2": "孔昭煥",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 13
  },
  {
    "k1": "孔廣森",
    "kg2": [{
        "v": 1,
        "k2": "孔繼涵",
        "gp": 2,
        "type": [
          "族叔"
        ]
      },
      {
        "v": 1,
        "k2": "孔繼汾",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "朱軾",
    "kg2": [{
        "v": 1,
        "k2": "朱璂",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "朱必坦",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "朱必堦",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 36
  },
  {
    "k1": "噶爾丹",
    "kg2": [{
        "v": 9,
        "k2": "丹津",
        "gp": 2,
        "type": [
          "同祖弟"
        ]
      },
      {
        "v": 9,
        "k2": "車臣",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 4,
        "k2": "僧格",
        "gp": 2,
        "type": [
          "同母兄"
        ]
      }
    ],
    "gp": 1,
    "idf": 149
  },
  {
    "k1": "楊長桂",
    "kg2": [{
        "v": 1,
        "k2": "楊廷璋",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "梁氏",
        "gp": 2,
        "type": [
          "嫡母,楊廷璋妻"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "英廉",
    "kg2": [{
        "v": 19,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "文學",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 279
  },
  {
    "k1": "楊凱",
    "kg2": [{
      "v": 1,
      "k2": "楊謙",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "王氏",
    "kg2": [{
      "v": 1,
      "k2": "王偉",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 292
  },
  {
    "k1": "蔣賜棨",
    "kg2": [{
        "v": 1,
        "k2": "蔣廷錫",
        "gp": 2,
        "type": [
          "祖父"
        ]
      },
      {
        "v": 2,
        "k2": "蔣溥",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 88
  },
  {
    "k1": "蔣溥",
    "kg2": [{
        "v": 2,
        "k2": "蔣賜棨",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 4,
        "k2": "蔣檙",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "蔣廷錫",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "蔣洲",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 153
  },
  {
    "k1": "邵基",
    "kg2": [{
      "v": 1,
      "k2": "邵洪",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 23
  },
  {
    "k1": "朱載",
    "kg2": [{
        "v": 2,
        "k2": "朱載",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 2,
        "k2": "朱載",
        "gp": 2,
        "type": [
          "兄"
        ]
      }
    ],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "李玉",
    "kg2": [{
      "v": 1,
      "k2": "李良",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 13
  },
  {
    "k1": "朱震",
    "kg2": [{
      "v": 1,
      "k2": "朱紹美",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "王進泰",
    "kg2": [{
      "v": 4,
      "k2": "王柄",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 121
  },
  {
    "k1": "李宏",
    "kg2": [{
        "v": 5,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "李奉翰",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "李慶徵",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 84
  },
  {
    "k1": "孫氏",
    "kg2": [{
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,臨安公主"
        ]
      },
      {
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,懷慶公主"
        ]
      }
    ],
    "gp": 1,
    "idf": 55
  },
  {
    "k1": "李周望",
    "kg2": [{
      "v": 1,
      "k2": "李旭升",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "董邦達",
    "kg2": [{
      "v": 4,
      "k2": "劉綸",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "吳寬",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "靳輔",
    "kg2": [{
      "v": 1,
      "k2": "陳潢",
      "gp": 2,
      "type": [
        "幕友"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "哈第爾",
    "kg2": [{
        "v": 1,
        "k2": "邁瑪第敏",
        "gp": 2,
        "type": [
          "姪曾孫"
        ]
      },
      {
        "v": 2,
        "k2": "霍集斯",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 26
  },
  {
    "k1": "李奉翰",
    "kg2": [{
        "v": 3,
        "k2": "李慶徵",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "李亨特",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "李宏",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 16,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 359
  },
  {
    "k1": "黃嘉謨",
    "kg2": [{
      "v": 2,
      "k2": "黃仕簡",
      "gp": 2,
      "type": [
        "祖"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "何勉",
    "kg2": [{
      "v": 1,
      "k2": "何思和",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "黃道周",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "陳履平",
    "kg2": [{
      "v": 1,
      "k2": "汪士鍠",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "汪為霖",
    "kg2": [{
      "v": 1,
      "k2": "汪之珩",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "法靈阿",
    "kg2": [{
        "v": 1,
        "k2": "海昌",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "堆音齊",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "圖納",
        "gp": 2,
        "type": [
          "從叔祖"
        ]
      }
    ],
    "gp": 1,
    "idf": 27
  },
  {
    "k1": "阿睦爾撒納",
    "kg2": [{
        "v": 54,
        "k2": "班珠爾",
        "gp": 2,
        "type": [
          "同母異父兄"
        ]
      },
      {
        "v": 1,
        "k2": "丹衷",
        "gp": 2,
        "type": [
          "同母異父兄"
        ]
      }
    ],
    "gp": 1,
    "idf": 337
  },
  {
    "k1": "陳汝捷",
    "kg2": [{
      "v": 1,
      "k2": "方觀承",
      "gp": 2,
      "type": [
        "保舉者"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "葉酉",
    "kg2": [{
        "v": 1,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "沈德潛",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 2,
        "k2": "袁枚",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "馮鈐",
    "kg2": [{
      "v": 6,
      "k2": "沈作朋",
      "gp": 2,
      "type": [
        "兒女姻親"
      ]
    }],
    "gp": 1,
    "idf": 142
  },
  {
    "k1": "王慶長",
    "kg2": [{
      "v": 1,
      "k2": "王燕緒",
      "gp": 2,
      "type": [
        "叔"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "盧見曾",
    "kg2": [{
        "v": 1,
        "k2": "盧謙",
        "gp": 2,
        "type": [
          "長子"
        ]
      },
      {
        "v": 2,
        "k2": "盧謨",
        "gp": 2,
        "type": [
          "第三子"
        ]
      },
      {
        "v": 3,
        "k2": "紀昀",
        "gp": 2,
        "type": [
          "友"
        ]
      },
      {
        "v": 2,
        "k2": "王昶",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 20
  },
  {
    "k1": "張勇",
    "kg2": [{
        "v": 2,
        "k2": "張承勳",
        "gp": 2,
        "type": [
          "四世孫"
        ]
      },
      {
        "v": 1,
        "k2": "張謙",
        "gp": 2,
        "type": [
          "曾孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "宋瑛",
    "kg2": [{
      "v": 1,
      "k2": "宋瑛",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "戴衢亨",
    "kg2": [{
      "v": 1,
      "k2": "戴第元",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "柴大紀",
    "kg2": [{
        "v": 1,
        "k2": "柴際盛",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "柴際甲",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 127
  },
  {
    "k1": "白鍾山",
    "kg2": [{
      "v": 1,
      "k2": "白永淳",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 325
  },
  {
    "k1": "裘行簡",
    "kg2": [{
      "v": 3,
      "k2": "裘曰修",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "范時捷",
    "kg2": [{
      "v": 1,
      "k2": "范濟",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "朱筠",
    "kg2": [{
      "v": 1,
      "k2": "朱珪",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "錢大昕",
    "kg2": [{
      "v": 3,
      "k2": "王鳴盛",
      "gp": 2,
      "type": [
        "內兄"
      ]
    }],
    "gp": 1,
    "idf": 16
  },
  {
    "k1": "秦潮",
    "kg2": [{
        "v": 2,
        "k2": "秦鐄",
        "gp": 2,
        "type": [
          "伯叔父"
        ]
      },
      {
        "v": 4,
        "k2": "秦泉",
        "gp": 2,
        "type": [
          "兄弟"
        ]
      },
      {
        "v": 3,
        "k2": "秦鴻甲",
        "gp": 2,
        "type": [
          "堂弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 19
  },
  {
    "k1": "熊學鵬",
    "kg2": [{
      "v": 2,
      "k2": "熊之台",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 252
  },
  {
    "k1": "王亶望",
    "kg2": [{
        "v": 1,
        "k2": "王晉",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "王師",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 3,
        "k2": "王裘",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王紳",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王鈺",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王瑤",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王海官",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王越",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "王焯",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "王庚官",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 196
  },
  {
    "k1": "郝林",
    "kg2": [{
        "v": 1,
        "k2": "張氏",
        "gp": 2,
        "type": [
          "繼配"
        ]
      },
      {
        "v": 1,
        "k2": "張氏",
        "gp": 2,
        "type": [
          "元配"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "于易簡",
    "kg2": [{
      "v": 7,
      "k2": "于敏中",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 38
  },
  {
    "k1": "孔昭煥",
    "kg2": [{
        "v": 3,
        "k2": "孔繼汾",
        "gp": 2,
        "type": [
          "叔祖"
        ]
      },
      {
        "v": 2,
        "k2": "孔廣棨",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "孔憲培",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "孔子",
        "gp": 2,
        "type": [
          "遠祖"
        ]
      }
    ],
    "gp": 1,
    "idf": 26
  },
  {
    "k1": "張英",
    "kg2": [{
      "v": 1,
      "k2": "張廷玉",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "黃景仁",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "李奉堯",
    "kg2": [{
      "v": 5,
      "k2": "李侍堯",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "盧瑛",
    "kg2": [{
      "v": 1,
      "k2": "文學",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "永安",
    "kg2": [{
      "v": 2,
      "k2": "興寧",
      "gp": 2,
      "type": [
        "岳父,奉恩輔國公"
      ]
    }],
    "gp": 1,
    "idf": 120
  },
  {
    "k1": "范文程",
    "kg2": [{
        "v": 1,
        "k2": "范承謨",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "范宜恒",
        "gp": 2,
        "type": [
          "曾孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "許文謨",
    "kg2": [{
      "v": 4,
      "k2": "許世亨",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "陳元龍",
    "kg2": [{
      "v": 3,
      "k2": "陳世倌",
      "gp": 2,
      "type": [
        "從子"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "陳名夏",
    "kg2": [{
      "v": 1,
      "k2": "魏象樞",
      "gp": 2,
      "type": [
        "姻親"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "哈國興",
    "kg2": [{
        "v": 2,
        "k2": "哈文虎",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "哈國泰",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 100
  },
  {
    "k1": "謝啟昆",
    "kg2": [{
      "v": 2,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "任蘭枝",
    "kg2": [{
      "v": 1,
      "k2": "任端書",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 38
  },
  {
    "k1": "永德",
    "kg2": [{
        "v": 5,
        "k2": "德保",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "烏勒登額",
        "gp": 2,
        "type": [
          "嗣子"
        ]
      }
    ],
    "gp": 1,
    "idf": 176
  },
  {
    "k1": "陳鵬年",
    "kg2": [{
      "v": 1,
      "k2": "陳樹萱",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "徐氏",
    "kg2": [{
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,永安公主"
        ]
      },
      {
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,永平公主"
        ]
      },
      {
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,安成公主"
        ]
      },
      {
        "v": 1,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,咸寧公主"
        ]
      }
    ],
    "gp": 1,
    "idf": 63
  },
  {
    "k1": "清保",
    "kg2": [{
      "v": 1,
      "k2": "德昌",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "葉體仁",
    "kg2": [{
        "v": 2,
        "k2": "葉道和",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "耿陞",
        "gp": 2,
        "type": [
          "耿貴之子"
        ]
      },
      {
        "v": 1,
        "k2": "耿貴",
        "gp": 2,
        "type": [
          "契買家人"
        ]
      }
    ],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "圖拉",
    "kg2": [{
      "v": 1,
      "k2": "常泰",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 40
  },
  {
    "k1": "王景曾",
    "kg2": [{
      "v": 1,
      "k2": "王熙",
      "gp": 2,
      "type": [
        "祖父,大學士"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "吳省欽",
    "kg2": [{
      "v": 2,
      "k2": "吳省蘭",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 58
  },
  {
    "k1": "余集",
    "kg2": [{
        "v": 1,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "裘曰修",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "吉慶",
    "kg2": [{
        "v": 9,
        "k2": "高晉",
        "gp": 2,
        "type": [
          "兒女姻親"
        ]
      },
      {
        "v": 1,
        "k2": "覺羅萬福",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 332
  },
  {
    "k1": "秦蕙田",
    "kg2": [{
      "v": 2,
      "k2": "吳鼐",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 64
  },
  {
    "k1": "吳紹詩",
    "kg2": [{
        "v": 7,
        "k2": "吳壇",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "吳垣",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 85
  },
  {
    "k1": "張謙",
    "kg2": [{
        "v": 1,
        "k2": "張承勳",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "張勇",
        "gp": 2,
        "type": [
          "曾祖父"
        ]
      }
    ],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "蔣廷錫",
    "kg2": [{
        "v": 1,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 1,
        "k2": "蔣檙",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 1,
        "k2": "蔣洲",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "蔣溥",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "蔣賜棨",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "安泰",
    "kg2": [{
      "v": 1,
      "k2": "伊魯爾圖",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 162
  },
  {
    "k1": "茅元銘",
    "kg2": [{
      "v": 1,
      "k2": "書法",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "吳應棻",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "佟國綱",
    "kg2": [{
      "v": 1,
      "k2": "介福",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "何裕城",
    "kg2": [{
      "v": 1,
      "k2": "何煟",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 226
  },
  {
    "k1": "李倧",
    "kg2": [{
      "v": 1,
      "k2": "李昑",
      "gp": 2,
      "type": [
        "玄孫,朝鮮英祖"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "田懋",
    "kg2": [{
        "v": 2,
        "k2": "田從典",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "田玉麟",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 22
  },
  {
    "k1": "劉基",
    "kg2": [{
      "v": 2,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "張本",
    "kg2": [{
      "v": 2,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 18
  },
  {
    "k1": "盛昌",
    "kg2": [{
      "v": 1,
      "k2": "慶裕",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "陳益",
    "kg2": [{
      "v": 1,
      "k2": "陳大用",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "雷鋐",
    "kg2": [{
        "v": 3,
        "k2": "彭啟豐",
        "gp": 2,
        "type": [
          "同事"
        ]
      },
      {
        "v": 1,
        "k2": "方苞",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "扎拉芬",
    "kg2": [{
      "v": 2,
      "k2": "德福",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 14
  },
  {
    "k1": "劉統勳",
    "kg2": [{
        "v": 1,
        "k2": "劉鐶之",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 10,
        "k2": "劉墉",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 458
  },
  {
    "k1": "徐琳",
    "kg2": [{
      "v": 1,
      "k2": "李元亮",
      "gp": 2,
      "type": [
        "薦舉者"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "錢汝誠",
    "kg2": [{
        "v": 4,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "錢陳群",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 67
  },
  {
    "k1": "鄭昭",
    "kg2": [{
      "v": 3,
      "k2": "鄭華",
      "gp": 2,
      "type": [
        "自稱為鄭昭之子"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "呂留良",
    "kg2": [{
        "v": 7,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "呂懿兼",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 2,
        "k2": "呂敷先",
        "gp": 2,
        "type": [
          "曾孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "黎維禕",
    "kg2": [{
        "v": 3,
        "k2": "黎維祜",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 11,
        "k2": "黎維",
        "gp": 2,
        "type": [
          "叔公"
        ]
      }
    ],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "納穆圖",
    "kg2": [{
      "v": 1,
      "k2": "嗣存",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "李思忠",
    "kg2": [{
      "v": 1,
      "k2": "李周德",
      "gp": 2,
      "type": [
        "曾孫"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "費元龍",
    "kg2": [{
      "v": 1,
      "k2": "劉藻",
      "gp": 2,
      "type": [
        "舉薦者"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "李衛",
    "kg2": [{
      "v": 2,
      "k2": "李星垣",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 181
  },
  {
    "k1": "韓鑅",
    "kg2": [{
      "v": 1,
      "k2": "韓樹猷",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 101
  },
  {
    "k1": "嵇曾筠",
    "kg2": [{
        "v": 1,
        "k2": "水利工程",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 3,
        "k2": "嵇璜",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 105
  },
  {
    "k1": "梁國治",
    "kg2": [{
      "v": 1,
      "k2": "書法",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 104
  },
  {
    "k1": "楊景素",
    "kg2": [{
      "v": 4,
      "k2": "楊炤",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 200
  },
  {
    "k1": "張彤",
    "kg2": [{
      "v": 1,
      "k2": "張師誠",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "蘇爾相",
    "kg2": [{
        "v": 1,
        "k2": "蘇爾忠",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 1,
        "k2": "蘇爾福",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 65
  },
  {
    "k1": "阮光平",
    "kg2": [{
        "v": 12,
        "k2": "阮光顯",
        "gp": 2,
        "type": [
          "姪"
        ]
      },
      {
        "v": 8,
        "k2": "阮光纘",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 5,
        "k2": "阮光垂",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "阮岳",
        "gp": 2,
        "type": [
          "兄"
        ]
      }
    ],
    "gp": 1,
    "idf": 104
  },
  {
    "k1": "安然",
    "kg2": [{
      "v": 1,
      "k2": "不詳",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 38
  },
  {
    "k1": "尹嘉銓",
    "kg2": [{
      "v": 3,
      "k2": "尹會一",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 29
  },
  {
    "k1": "曹振鏞",
    "kg2": [{
        "v": 1,
        "k2": "翁方綱",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 1,
        "k2": "曹文埴",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "顧棟高",
    "kg2": [{
      "v": 1,
      "k2": "吳鼎",
      "gp": 2,
      "type": [
        "同學"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "熊志契",
    "kg2": [{
      "v": 1,
      "k2": "熊賜履",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "龔鼎孳",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "朱珪",
    "kg2": [{
      "v": 1,
      "k2": "朱筠",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 131
  },
  {
    "k1": "胡定",
    "kg2": [{
      "v": 2,
      "k2": "張鵬翀",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "吳璥",
    "kg2": [{
      "v": 2,
      "k2": "吳嗣爵",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "彭元瑞",
    "kg2": [{
      "v": 2,
      "k2": "彭良馵",
      "gp": 2,
      "type": [
        "從子"
      ]
    }],
    "gp": 1,
    "idf": 93
  },
  {
    "k1": "歸宣光",
    "kg2": [{
      "v": 2,
      "k2": "歸景照",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 40
  },
  {
    "k1": "黎維祁",
    "kg2": [{
      "v": 1,
      "k2": "黎侗",
      "gp": 2,
      "type": [
        "族人"
      ]
    }],
    "gp": 1,
    "idf": 81
  },
  {
    "k1": "李中簡",
    "kg2": [{
      "v": 1,
      "k2": "戈濤",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 25
  },
  {
    "k1": "林君陞",
    "kg2": [{
      "v": 1,
      "k2": "胡貴",
      "gp": 2,
      "type": [
        "親家"
      ]
    }],
    "gp": 1,
    "idf": 22
  },
  {
    "k1": "彭家屏",
    "kg2": [{
      "v": 3,
      "k2": "彭傳笏",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 55
  },
  {
    "k1": "梅瑴成",
    "kg2": [{
      "v": 1,
      "k2": "梅釴",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 37
  },
  {
    "k1": "秦瀛",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "吳壇",
    "kg2": [{
        "v": 7,
        "k2": "吳紹詩",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "吳垣",
        "gp": 2,
        "type": [
          "兄"
        ]
      }
    ],
    "gp": 1,
    "idf": 55
  },
  {
    "k1": "黎維祜",
    "kg2": [{
        "v": 4,
        "k2": "黎維",
        "gp": 2,
        "type": [
          "叔公"
        ]
      },
      {
        "v": 3,
        "k2": "黎維禕",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "楊謙",
    "kg2": [{
      "v": 1,
      "k2": "楊凱",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "董其昌",
    "kg2": [{
      "v": 1,
      "k2": "書法",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "邵洪",
    "kg2": [{
      "v": 1,
      "k2": "邵基",
      "gp": 2,
      "type": [
        "祖父"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "梁敦書",
    "kg2": [{
      "v": 2,
      "k2": "梁詩正",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 27
  },
  {
    "k1": "王萬邦",
    "kg2": [{
      "v": 1,
      "k2": "王萬里",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "陶正靖",
    "kg2": [{
        "v": 1,
        "k2": "陶正一",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 2,
        "k2": "任蘭枝",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 13
  },
  {
    "k1": "王進寶",
    "kg2": [{
      "v": 1,
      "k2": "王永",
      "gp": 2,
      "type": [
        "玄孫"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "周景",
    "kg2": [{
      "v": 1,
      "k2": "詩人",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "何思和",
    "kg2": [{
        "v": 1,
        "k2": "何勉",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "何夢枚",
        "gp": 2,
        "type": [
          "繼子"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "楊漣",
    "kg2": [{
      "v": 1,
      "k2": "楊可鏡",
      "gp": 2,
      "type": [
        "玄孫"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "達賚",
    "kg2": [{
        "v": 5,
        "k2": "那蘇圖",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "多爾吉",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 39
  },
  {
    "k1": "張廷璐",
    "kg2": [{
      "v": 2,
      "k2": "張廷瑑",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "秦雄飛",
    "kg2": [{
      "v": 1,
      "k2": "秦錫疇",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "盧象昇",
    "kg2": [{
      "v": 1,
      "k2": "盧國霦",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "王時翔",
    "kg2": [{
      "v": 1,
      "k2": "王澄",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "盧焯",
    "kg2": [{
      "v": 1,
      "k2": "盧山",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 133
  },
  {
    "k1": "劉墉",
    "kg2": [{
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "劉墫",
        "gp": 2,
        "type": [
          "從兄"
        ]
      },
      {
        "v": 10,
        "k2": "劉統勳",
        "gp": 2,
        "type": [
          "父"
        ]
      }
    ],
    "gp": 1,
    "idf": 160
  },
  {
    "k1": "李國梁",
    "kg2": [{
      "v": 1,
      "k2": "李瑞",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 31
  },
  {
    "k1": "汪廷璵",
    "kg2": [{
      "v": 1,
      "k2": "王宬",
      "gp": 2,
      "type": [
        "岳父"
      ]
    }],
    "gp": 1,
    "idf": 31
  },
  {
    "k1": "陳大復",
    "kg2": [{
      "v": 1,
      "k2": "秦蕙田",
      "gp": 2,
      "type": [
        "同鄉京官"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "吳應枚",
    "kg2": [{
      "v": 2,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 32
  },
  {
    "k1": "溫葆初",
    "kg2": [{
        "v": 1,
        "k2": "溫葆經",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "黃登賢",
        "gp": 2,
        "type": [
          "郎舅親戚"
        ]
      }
    ],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "拉特納巴都爾",
    "kg2": [{
      "v": 6,
      "k2": "巴都爾薩野",
      "gp": 2,
      "type": [
        "叔父"
      ]
    }],
    "gp": 1,
    "idf": 19
  },
  {
    "k1": "任承恩",
    "kg2": [{
        "v": 1,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 5,
        "k2": "任舉",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "任承緒",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 71
  },
  {
    "k1": "齊周華",
    "kg2": [{
      "v": 5,
      "k2": "齊召南",
      "gp": 2,
      "type": [
        "族弟"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "范承謨",
    "kg2": [{
        "v": 1,
        "k2": "范文程",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "范宜恒",
        "gp": 2,
        "type": [
          "姪孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "明安",
    "kg2": [{
      "v": 4,
      "k2": "福來",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 241
  },
  {
    "k1": "兆德",
    "kg2": [{
        "v": 1,
        "k2": "富銳",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "哈達哈",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "豐盛額",
    "kg2": [{
        "v": 1,
        "k2": "豐安",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "愛星阿",
        "gp": 2,
        "type": [
          "曾祖父"
        ]
      }
    ],
    "gp": 1,
    "idf": 21
  },
  {
    "k1": "藍元枚",
    "kg2": [{
        "v": 5,
        "k2": "藍廷珍",
        "gp": 2,
        "type": [
          "祖父"
        ]
      },
      {
        "v": 1,
        "k2": "藍誠",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 51
  },
  {
    "k1": "劉墫",
    "kg2": [{
      "v": 2,
      "k2": "劉墉",
      "gp": 2,
      "type": [
        "從弟"
      ]
    }],
    "gp": 1,
    "idf": 19
  },
  {
    "k1": "錢謙益",
    "kg2": [{
      "v": 13,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 19
  },
  {
    "k1": "王敬",
    "kg2": [{
      "v": 1,
      "k2": "王恒",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "王文",
    "kg2": [{
        "v": 1,
        "k2": "王倫",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 5,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 56
  },
  {
    "k1": "周廷俊",
    "kg2": [{
      "v": 1,
      "k2": "周廷元",
      "gp": 2,
      "type": [
        "弟"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "王念孫",
    "kg2": [{
        "v": 1,
        "k2": "王安國",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "戴震",
        "gp": 2,
        "type": [
          "師"
        ]
      }
    ],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "戴震",
    "kg2": [{
        "v": 1,
        "k2": "王念孫",
        "gp": 2,
        "type": [
          "學生,王安國之子"
        ]
      },
      {
        "v": 2,
        "k2": "邵晉涵",
        "gp": 2,
        "type": [
          "交遊"
        ]
      },
      {
        "v": 1,
        "k2": "姚鼐",
        "gp": 2,
        "type": [
          "交遊"
        ]
      },
      {
        "v": 1,
        "k2": "朱珪",
        "gp": 2,
        "type": [
          "交遊"
        ]
      },
      {
        "v": 1,
        "k2": "任大椿",
        "gp": 2,
        "type": [
          "學生"
        ]
      }
    ],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "王熙",
    "kg2": [{
      "v": 1,
      "k2": "王景曾",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "明德",
    "kg2": [{
        "v": 6,
        "k2": "和其衷",
        "gp": 2,
        "type": [
          "弟兄"
        ]
      },
      {
        "v": 2,
        "k2": "全德",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 397
  },
  {
    "k1": "秦炌",
    "kg2": [{
      "v": 1,
      "k2": "秦廷璽",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "畢沅",
    "kg2": [{
        "v": 31,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "小學",
        "gp": 2,
        "type": [
          "專長"
        ]
      },
      {
        "v": 2,
        "k2": "沈德潛",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 1,
        "k2": "錢大昕",
        "gp": 2,
        "type": [
          "友"
        ]
      }
    ],
    "gp": 1,
    "idf": 672
  },
  {
    "k1": "雅爾呼達",
    "kg2": [{
      "v": 1,
      "k2": "珠通阿",
      "gp": 2,
      "type": [
        "孫"
      ]
    }],
    "gp": 1,
    "idf": 19
  },
  {
    "k1": "袁崇煥",
    "kg2": [{
      "v": 2,
      "k2": "袁炳",
      "gp": 2,
      "type": [
        "五世孫"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "翁方綱",
    "kg2": [{
        "v": 2,
        "k2": "阮元",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 1,
        "k2": "程晉芳",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 2,
        "k2": "盧文弨",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 1,
        "k2": "曹振鏞",
        "gp": 2,
        "type": [
          "徒"
        ]
      },
      {
        "v": 1,
        "k2": "邵晉涵",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 1,
        "k2": "朱筠",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 2,
        "k2": "錢大昕",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 1,
        "k2": "朱珪",
        "gp": 2,
        "type": [
          "交游"
        ]
      }
    ],
    "gp": 1,
    "idf": 38
  },
  {
    "k1": "張朝龍",
    "kg2": [{
      "v": 1,
      "k2": "張文貴",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 12
  },
  {
    "k1": "陳大受",
    "kg2": [{
        "v": 1,
        "k2": "陳嚴祖",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 5,
        "k2": "陳輝祖",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 286
  },
  {
    "k1": "平安",
    "kg2": [{
      "v": 2,
      "k2": "平定",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 32
  },
  {
    "k1": "紀山",
    "kg2": [{
      "v": 2,
      "k2": "額倫特",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 219
  },
  {
    "k1": "郝碩",
    "kg2": [{
      "v": 1,
      "k2": "郝玉麟",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 154
  },
  {
    "k1": "趙文英",
    "kg2": [{
      "v": 1,
      "k2": "趙瓚",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "陳繩祖",
    "kg2": [{
      "v": 1,
      "k2": "陳輝祖",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "冶大雄",
    "kg2": [{
      "v": 4,
      "k2": "冶繼鈞",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 36
  },
  {
    "k1": "范宜恒",
    "kg2": [{
        "v": 1,
        "k2": "范承謨",
        "gp": 2,
        "type": [
          "祖"
        ]
      },
      {
        "v": 1,
        "k2": "范文程",
        "gp": 2,
        "type": [
          "曾祖"
        ]
      }
    ],
    "gp": 1,
    "idf": 9
  },
  {
    "k1": "達啟",
    "kg2": [{
      "v": 1,
      "k2": "黃廷桂",
      "gp": 2,
      "type": [
        "保舉者"
      ]
    }],
    "gp": 1,
    "idf": 16
  },
  {
    "k1": "李侍堯",
    "kg2": [{
        "v": 5,
        "k2": "李元亮",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 3,
        "k2": "李永芳",
        "gp": 2,
        "type": [
          "高祖"
        ]
      },
      {
        "v": 5,
        "k2": "李奉堯",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 924
  },
  {
    "k1": "汪啟淑",
    "kg2": [{
      "v": 1,
      "k2": "藏書",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "李調元",
    "kg2": [{
      "v": 1,
      "k2": "趙翼",
      "gp": 2,
      "type": [
        "友,並稱林下四老"
      ]
    }],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "楊士英",
    "kg2": [{
      "v": 1,
      "k2": "王氏",
      "gp": 2,
      "type": [
        "子婦；兒媳"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "熊賜履",
    "kg2": [{
      "v": 1,
      "k2": "熊志契",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "楊應琚",
    "kg2": [{
        "v": 5,
        "k2": "楊重穀",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 5,
        "k2": "楊重英",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "楊茂齡",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 545
  },
  {
    "k1": "楊錫紱",
    "kg2": [{
        "v": 41,
        "k2": "陳宏謀",
        "gp": 2,
        "type": [
          "交游"
        ]
      },
      {
        "v": 1,
        "k2": "書法",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 279
  },
  {
    "k1": "黃模",
    "kg2": [{
      "v": 2,
      "k2": "黃廷桂",
      "gp": 2,
      "type": [
        "祖父"
      ]
    }],
    "gp": 1,
    "idf": 11
  },
  {
    "k1": "李紱",
    "kg2": [{
        "v": 1,
        "k2": "李孝源",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "李孝洋",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "李孝",
        "gp": 2,
        "type": [
          "子"
        ]
      }
    ],
    "gp": 1,
    "idf": 27
  },
  {
    "k1": "黃仕簡",
    "kg2": [{
        "v": 8,
        "k2": "黃秉淳",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "黃嘉謨",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 128
  },
  {
    "k1": "賽炳阿",
    "kg2": [{
      "v": 1,
      "k2": "舒敏",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "孔憲培",
    "kg2": [{
        "v": 1,
        "k2": "孔傳鐸",
        "gp": 2,
        "type": [
          "高祖父"
        ]
      },
      {
        "v": 2,
        "k2": "孔昭煥",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "于敏中",
        "gp": 2,
        "type": [
          "岳父"
        ]
      }
    ],
    "gp": 1,
    "idf": 7
  },
  {
    "k1": "張若震",
    "kg2": [{
      "v": 4,
      "k2": "張廷玉",
      "gp": 2,
      "type": [
        "伯"
      ]
    }],
    "gp": 1,
    "idf": 58
  },
  {
    "k1": "梁詩正",
    "kg2": [{
        "v": 3,
        "k2": "梁啟心",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "梁同書",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "梁敦書",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 3,
        "k2": "梁文濂",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 2,
        "k2": "高山",
        "gp": 2,
        "type": [
          "房師"
        ]
      }
    ],
    "gp": 1,
    "idf": 97
  },
  {
    "k1": "莊鈞",
    "kg2": [{
      "v": 1,
      "k2": "裴宗錫",
      "gp": 2,
      "type": [
        "連襟"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  {
    "k1": "高其佩",
    "kg2": [{
        "v": 1,
        "k2": "高綱",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "高秉",
        "gp": 2,
        "type": [
          "孫"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "伍彌泰",
    "kg2": [{
      "v": 1,
      "k2": "伍彌烏遜",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 95
  },
  {
    "k1": "徐述夔",
    "kg2": [{
        "v": 11,
        "k2": "徐食田",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 1,
        "k2": "徐食書",
        "gp": 2,
        "type": [
          "孫"
        ]
      },
      {
        "v": 2,
        "k2": "徐懷祖",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 1,
        "k2": "徐賡武",
        "gp": 2,
        "type": [
          "從弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "赫昇額",
    "kg2": [{
        "v": 1,
        "k2": "保成",
        "gp": 2,
        "type": [
          "親家"
        ]
      },
      {
        "v": 7,
        "k2": "張宏燧",
        "gp": 2,
        "type": [
          "門生"
        ]
      }
    ],
    "gp": 1,
    "idf": 24
  },
  {
    "k1": "張燕翼",
    "kg2": [{
        "v": 1,
        "k2": "張燕翼",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "張燕翼",
        "gp": 2,
        "type": [
          "弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 1
  },
  {
    "k1": "齊召南",
    "kg2": [{
      "v": 5,
      "k2": "齊周華",
      "gp": 2,
      "type": [
        "[族兄][族子]"
      ]
    }],
    "gp": 1,
    "idf": 20
  },
  {
    "k1": "錢度",
    "kg2": [{
      "v": 4,
      "k2": "錢酆",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 77
  },
  {
    "k1": "達爾吉善",
    "kg2": [{
      "v": 1,
      "k2": "劉氏",
      "gp": 2,
      "type": [
        "生母"
      ]
    }],
    "gp": 1,
    "idf": 28
  },
  {
    "k1": "裘曰修",
    "kg2": [{
        "v": 3,
        "k2": "裘行簡",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 8,
        "k2": "蔣溥",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 1,
        "k2": "裘麟",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 2,
        "k2": "袁枚",
        "gp": 2,
        "type": [
          "師兄弟"
        ]
      }
    ],
    "gp": 1,
    "idf": 250
  },
  {
    "k1": "蔣炳",
    "kg2": [{
      "v": 3,
      "k2": "彭啟豐",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 156
  },
  {
    "k1": "劉君輔",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 31
  },
  {
    "k1": "胡中藻",
    "kg2": [{
        "v": 5,
        "k2": "胡中藩",
        "gp": 2,
        "type": [
          "弟"
        ]
      },
      {
        "v": 2,
        "k2": "胡論洙",
        "gp": 2,
        "type": [
          "子"
        ]
      },
      {
        "v": 5,
        "k2": "鄂爾泰",
        "gp": 2,
        "type": [
          "師"
        ]
      },
      {
        "v": 3,
        "k2": "張紹渠",
        "gp": 2,
        "type": [
          "姻親"
        ]
      },
      {
        "v": 5,
        "k2": "李蘊芳",
        "gp": 2,
        "type": [
          "門生"
        ]
      }
    ],
    "gp": 1,
    "idf": 42
  },
  {
    "k1": "吳宗寧",
    "kg2": [{
      "v": 2,
      "k2": "黃廷桂",
      "gp": 2,
      "type": [
        "姊夫"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "黃鉞",
    "kg2": [{
      "v": 1,
      "k2": "詩",
      "gp": 2,
      "type": [
        "專長"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "唐英",
    "kg2": [{
      "v": 3,
      "k2": "寅保",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "謝濟世",
    "kg2": [{
      "v": 2,
      "k2": "謝夢熊",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 25
  },
  {
    "k1": "歸景照",
    "kg2": [{
      "v": 2,
      "k2": "歸宣光",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 15
  },
  {
    "k1": "汪承霈",
    "kg2": [{
        "v": 3,
        "k2": "汪由敦",
        "gp": 2,
        "type": [
          "父"
        ]
      },
      {
        "v": 1,
        "k2": "汪承沆",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "詩",
        "gp": 2,
        "type": [
          "專長"
        ]
      }
    ],
    "gp": 1,
    "idf": 39
  },
  {
    "k1": "馬氏",
    "kg2": [{
        "v": 2,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,安慶公主"
        ]
      },
      {
        "v": 3,
        "k2": "馬甲",
        "gp": 2,
        "type": [
          "從弟"
        ]
      },
      {
        "v": 2,
        "k2": "朱氏",
        "gp": 2,
        "type": [
          "女,寧國公主"
        ]
      }
    ],
    "gp": 1,
    "idf": 56
  },
  {
    "k1": "吳省蘭",
    "kg2": [{
      "v": 2,
      "k2": "吳省欽",
      "gp": 2,
      "type": [
        "兄"
      ]
    }],
    "gp": 1,
    "idf": 23
  },
  {
    "k1": "舒德",
    "kg2": [{
        "v": 1,
        "k2": "舒保",
        "gp": 2,
        "type": [
          "兄"
        ]
      },
      {
        "v": 1,
        "k2": "西蒙額",
        "gp": 2,
        "type": [
          "姪"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "張傑",
    "kg2": [{
      "v": 1,
      "k2": "張良弼",
      "gp": 2,
      "type": [
        "子"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "史奕昂",
    "kg2": [{
      "v": 6,
      "k2": "史貽直",
      "gp": 2,
      "type": [
        "父"
      ]
    }],
    "gp": 1,
    "idf": 40
  },
  {
    "k1": "繆其吉",
    "kg2": [{
      "v": 1,
      "k2": "王氏",
      "gp": 2,
      "type": [
        "曾祖母"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {
    "k1": "陸隴其",
    "kg2": [{
      "v": 5,
      "k2": "湯斌",
      "gp": 2,
      "type": [
        "友"
      ]
    }],
    "gp": 1,
    "idf": 7
  }
]