jdata = [
  // {
  //   "k1": "曾國藩",
  //   "kg2": [{
  //       "v": 1,
  //       "k2": "李鴻章",
  //       "gp": 2, group會根據分群去給予每個node 不同顏色
  //       "type": [
  //         "父子"
  //       ]
  //     },
  // {
  //   "v": 1,
  //   "k2": "曾國荃",
  //   "gp": 2,
  //   "type": [
  //     "兄弟"
  //   ]
  // },
  // {
  //   "v": 1,
  //   "k2": "左宗棠",
  //   "gp": 2,
  //   "type": [
  //     "hasStudent"
  //   ]
  // }
  // ],
  // "gp": 1,
  // "idf": 2
  // },
  // {
  //   "k1": "李鴻章",
  //   "kg2": [{
  //     "v": 1,
  //     "k2": "曾國藩",
  //     "gp": 2,
  //     "type": [
  //       "hasTeacher"
  //     ]
  //   }],
  //   "gp": 1,
  //   "idf": 2
  // },
  {
    "k1": "曾國荃",
    "kg2": [{
      "v": 5,
      "k2": "曾國藩",
      "gp": 2,
      "idf": 13,
      "type": [
        "hasBrother"
      ]
    }],
    "gp": 1,
    "idf": 6
  },
  {
    "k1": "翁同龢",
    "kg2": [
      {
        "v": 1,
        "k2": "翁心存",
        "gp": 2,
        "idf": 10,
        "type": [
          "父子"
        ]
      }
    ],
    "gp": 1,
    "idf": 8
  },
  {
    "k1": "翁心存",
    "kg2": [{
      "v": 3,
      "k2": "翁同龢",
      "gp": 2,
      "idf": 8,
      "type": [
        "hasSon"
      ]
    }],
    "gp": 1,
    "idf": 10
  },
  {//如果只有一個單獨的node的話 要重複自己
    "k1": "挖屋挖",
    "kg2": [{
      "v": 0,
      "k2": "挖屋挖",
      "gp": 3,
      "idf": 0,
      "type": [
        '未定義'
      ]
    }],
    "gp": 1,
    "idf": 0
  },
  {
    "k1": "曾國拉",
    "kg2": [{
      "v": 0,
      "k2": "翁同同",
      "gp": 2,
      "idf": 8,
      "type": [
        "未定義"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  // {
  //   "k1": "JJ",
  //   "kg2": [{
  //     "v": 0,
  //     "k2": "JJ",
  //     "gp": 2,
  //     "idf": 0,
  //     "type": [
  //       "has uncle"
  //     ]
  //   }],
  //   "gp": 1,
  //   "idf": 0
  // },
  {
    "k1": "張國依",
    "kg2": [{
      "v": 0,
      "k2": "JJ",
      "gp": 2,
      "idf": 1,
      "type": [
        "has uncle"
      ]
    }],
    "gp": 1,
    "idf": 17
  },{
    "k1": "張三",
    "kg2": [{
      "v": 5,
      "k2": "李四",
      "gp": 2,
      "idf": 0,
      "type": [
        '未定義'
      ]
    }],
    "gp": 1,
    "idf": 0
  },{
    "k1": "李四",
    "kg2": [{
      "v": 0,
      "k2": "王武",
      "gp": 2,
      "idf": 2,
      "type": [
        '未定義'
      ]
    }],
    "gp": 1,
    "idf": 0
  },{
    "k1": "王武",
    "kg2": [{
      "v": 5,
      "k2": "林六",
      "gp": 2,
      "idf": 4,
      "type": [
        'frend'
      ]
    }],
    "gp": 1,
    "idf": 2
  },{
    "k1": "林六",
    "kg2": [{
      "v": 7,
      "k2": "戚戚",
      "gp": 2,
      "idf": 3,
      "type": [
        'frend'
      ]
    }],
    "gp": 1,
    "idf": 4
  },
  {
    "k1": "錢臻",
    "kg2": [{
        "v": 1,
        "k2": "錢俊",
        "gp": 2,
        "idf": 5,
        "type": [
          "hasBrother"
        ]
      },
      {
        "v": 1,
        "k2": "錢楷",
        "gp": 2,
        "idf": 5,
        "type": [
          "hasCousin"
        ]
      },
      {
        "v": 9,
        "k2": "方受疇",
        "gp": 2,
        "idf": 5,
        "type": [
          "hasCousin"
        ]
      },
      {
        "v": 9,
        "k2": "吳璥",
        "gp": 2,
        "idf": 5,
        "type": [
          "ulan1550_relative_by_marriage"
        ]
      }
    ],
    "gp": 1,
    "idf": 264
  },
  {
    "k1": "方維甸",
    "kg2": [{
      "v": 1,
      "k2": "方受疇",
      "gp": 2,
      "idf": 5,
      "type": [
        "hasCousin"
      ]
    }],
    "gp": 1,
    "idf": 16
  },
  {
    "k1": "方受疇",
    "kg2": [{
      "v": 1,
      "k2": "方維甸",
      "gp": 2,
      "idf": 16,
      "type": [
        "hasCousin"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "方維甸",
    "kg2": [{
      "v": 1,
      "k2": "方芳",
      "gp": 2,
      "idf": 3,
      "type": [
        "hasCousin"
      ]
    }],
    "gp": 1,
    "idf": 23
  },{
    "k1": "方一",
    "kg2": [{
      "v": 1,
      "k2": "方受疇",
      "gp": 2,
      "idf": 5,
      "type": [
        "hasmom"
      ]
    }],
    "gp": 1,
    "idf": 16
  },
  {
    "k1": "方受疇",
    "kg2": [{
      "v": 1,
      "k2": "方一",
      "gp": 2,
      "idf": 16,
      "type": [
        "hasdad"
      ]
    }],
    "gp": 1,
    "idf": 5
  },
  {
    "k1": "方一",
    "kg2": [{
      "v": 1,
      "k2": "方二",
      "gp": 2,
      "idf": 3,
      "type": [
        "hassister"
      ]
    }],
    "gp": 1,
    "idf": 3
  },
  // {
  //   "k1": "dd",
  //   "kg2": [{
  //     "v": 0,
  //     "k2": "",
  //     "gp": 2,
  //     "idf": 0,
  //     "type": [
  //       ""
  //     ]
  //   }],
  //   "gp": 1,
  //   "idf": 0
  // }
]