jdata = [
  {
    "k1": "曾國藩",
    "kg2": [{
        "v": 1,
        "k2": "李鴻章",
        "gp": 2,
        "type": [
          "父子"
        ]
      },
      {
        "v": 1,
        "k2": "曾國荃",
        "gp": 2,
        "type": [
          "hasBrother"
        ]
      },
      {
        "v": 1,
        "k2": "左宗棠",
        "gp": 2,
        "type": [
          "hasStudent"
        ]
      }
    ],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "李鴻章",
    "kg2": [{
      "v": 1,
      "k2": "曾國藩",
      "gp": 2,
      "type": [
        "hasTeacher"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "曾國荃",
    "kg2": [{
      "v": 1,
      "k2": "曾國藩",
      "gp": 2,
      "type": [
        "hasBrother"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "翁同龢",
    "kg2": [
      {
      "v": 1,
      "k2": "翁心存",
      "gp": 2,
      "type": [
        "父子"
      ]
    }
  ],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "翁心存",
    "kg2": [{
      "v": 1,
      "k2": "翁同龢",
      "gp": 2,
      "type": [
        "hasSon"
      ]
    }],
    "gp": 1,
    "idf": 2
  },
  {
    "k1": "林天齡",
    "kg2": [{
      "v": 1,
      "k2": "倭仁",
      "gp": 2,
      "type": [
        "ulan1500_related_to"
      ]
    }],
    "gp": 1,
    "idf": 2
  }
]