jdata = [{
    "k1": "曾國藩",
    "kg2": [{
        "v": 1,
        "k2": "左宗棠",
        "gp": 2,
        "type": ["弟子"]
    }, {
        "v": 1,
        "k2": "李鴻章",
        "gp": 2,
        "type": ["弟子"]
    }, {
        "v": 1,
        "k2": "曾國荃",
        "gp": 2,
        "type": ["弟"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "陳孚恩",
    "kg2": [{
        "v": 1,
        "k2": "黃宗",
        "gp": 2,
        "type": ["j"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "李鴻章",
    "kg2": [{
        "v": 1,
        "k2": "曾國藩",
        "gp": 2,
        "type": ["師"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "明德",
    "kg2": [{
        "v": 1,
        "k2": "公主",
        "gp": 2,
        "type": ["gh"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "曾國荃",
    "kg2": [{
        "v": 1,
        "k2": "曾國藩",
        "gp": 2,
        "type": ["兄"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "翁同龢",
    "kg2": [{
        "v": 1,
        "k2": "翁心存",
        "gp": 2,
        "type": ["父"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "翁心存",
    "kg2": [{
        "v": 1,
        "k2": "翁同龢",
        "gp": 2,
        "type": ["子"]
    }],
    "gp": 1,
    "idf": 1
}, {
    "k1": "林天齡",
    "kg2": [{
        "v": 1,
        "k2": "倭仁",
        "gp": 2,
        "type": ["知遇者"]
    }, {
        "v": 1,
        "k2": "長樂",
        "gp": 2,
        "type": ["籍貫"]
    }],
    "gp": 1,
    "idf": 1
}]