bookName = '紅樓夢';
bookId = '39267';
groupName = ["紅樓夢", "清朝人物", '虛擬人物'];
userColors = ["#ff8044", "#ff5349", "#FFAE42"];
jdata = [{
    "k1": "薛蝌",
    "kg2": [{"v": 8, "k2": "寶琴", "gp": 2, "idf": 79, "type": ["兄妹"]}, {
        "v": 5,
        "k2": "岫煙",
        "gp": 2,
        "idf": 44,
        "type": ["夫妻"]
    }],
    "gp": 1,
    "idf": 43
}, {"k1": "惜春", "kg2": [{"v": 9, "k2": "入畫", "gp": 2, "idf": 11, "type": ["主僕"]}], "gp": 1, "idf": 114}, {
    "k1": "賈府",
    "kg2": [{"v": 1, "k2": "晴雯", "gp": 2, "idf": 156, "type": ["主僕"]}],
    "gp": 1,
    "idf": 44
}, {"k1": "代儒", "kg2": [{"v": 2, "k2": "賈瑞", "gp": 2, "idf": 13, "type": ["祖孫"]}], "gp": 1, "idf": 21}, {
    "k1": "迎春",
    "kg2": [{"v": 14, "k2": "司棋", "gp": 2, "idf": 24, "type": ["主僕"]}],
    "gp": 1,
    "idf": 96
}, {
    "k1": "賈珠",
    "kg2": [{"v": 4, "k2": "李紈", "gp": 2, "idf": 250, "type": ["夫妻"]}, {
        "v": 1,
        "k2": "賈蘭",
        "gp": 2,
        "idf": 54,
        "type": ["父子"]
    }],
    "gp": 1,
    "idf": 7
}, {
    "k1": "王夫",
    "kg2": [{"v": 19, "k2": "金釧", "gp": 2, "idf": 30, "type": ["主僕"]}, {
        "v": 5,
        "k2": "彩霞",
        "gp": 2,
        "idf": 12,
        "type": ["主僕"]
    }, {"v": 4, "k2": "賈珠", "gp": 2, "idf": 7, "type": ["母子"]}, {
        "v": 305,
        "k2": "寶玉",
        "gp": 2,
        "idf": 1578,
        "type": ["母子"]
    }, {"v": 4, "k2": "元春", "gp": 2, "idf": 11, "type": ["母女"]}, {
        "v": 4,
        "k2": "熙鳳",
        "gp": 2,
        "idf": 13,
        "type": ["嬸姪"]
    }, {"v": 26, "k2": "釧兒", "gp": 2, "idf": 48, "type": ["主僕"]}, {
        "v": 95,
        "k2": "薛姨",
        "gp": 2,
        "idf": 250,
        "type": ["姊妹"]
    }],
    "gp": 1,
    "idf": 592
}, {
    "k1": "賈赦",
    "kg2": [{"v": 42, "k2": "賈璉", "gp": 2, "idf": 346, "type": ["父子"]}, {
        "v": 2,
        "k2": "迎春",
        "gp": 2,
        "idf": 96,
        "type": ["父女"]
    }, {"v": 3, "k2": "秋桐", "gp": 2, "idf": 15, "type": ["主僕"]}],
    "gp": 1,
    "idf": 103
}, {
    "k1": "賈璉",
    "kg2": [{"v": 67, "k2": "平兒", "gp": 2, "idf": 232, "type": ["夫妻"]}, {
        "v": 1,
        "k2": "熙鳳",
        "gp": 2,
        "idf": 13,
        "type": ["夫妻"]
    }, {"v": 13, "k2": "秋桐", "gp": 2, "idf": 15, "type": ["夫妻"]}, {
        "v": 2,
        "k2": "興兒",
        "gp": 2,
        "idf": 5,
        "type": ["主僕"]
    }],
    "gp": 1,
    "idf": 346
}, {
    "k1": "賈母",
    "kg2": [{"v": 367, "k2": "寶玉", "gp": 2, "idf": 1578, "type": ["婆孫"]}, {
        "v": 88,
        "k2": "襲人",
        "gp": 2,
        "idf": 469,
        "type": ["主僕"]
    }, {"v": 100, "k2": "鴛鴦", "gp": 2, "idf": 163, "type": ["主僕"]}, {
        "v": 35,
        "k2": "紫鵑",
        "gp": 2,
        "idf": 146,
        "type": ["主僕"]
    }, {"v": 127, "k2": "賈政", "gp": 2, "idf": 394, "type": ["母子"]}, {
        "v": 3,
        "k2": "傻大",
        "gp": 2,
        "idf": 10,
        "type": ["主僕"]
    }],
    "gp": 1,
    "idf": 774
}, {
    "k1": "賈珍",
    "kg2": [{"v": 1, "k2": "惜春", "gp": 2, "idf": 114, "type": ["兄妹"]}, {
        "v": 71,
        "k2": "賈蓉",
        "gp": 2,
        "idf": 135,
        "type": ["父子"]
    }, {"v": 3, "k2": "佩鳳", "gp": 2, "idf": 7, "type": ["夫妻"]}],
    "gp": 1,
    "idf": 196
}, {"k1": "湘雲", "kg2": [{"v": 11, "k2": "翠縷", "gp": 2, "idf": 13, "type": ["主僕"]}], "gp": 1, "idf": 204}, {
    "k1": "寶玉",
    "kg2": [{"v": 402, "k2": "黛玉", "gp": 2, "idf": 537, "type": ["知己"]}, {
        "v": 340,
        "k2": "寶釵",
        "gp": 2,
        "idf": 582,
        "type": ["夫妻"]
    }, {"v": 113, "k2": "麝月", "gp": 2, "idf": 118, "type": ["主僕"]}, {
        "v": 16,
        "k2": "小紅",
        "gp": 2,
        "idf": 28,
        "type": ["主僕"]
    }, {"v": 45, "k2": "秋紋", "gp": 2, "idf": 53, "type": ["主僕"]}, {
        "v": 9,
        "k2": "墜兒",
        "gp": 2,
        "idf": 11,
        "type": ["主僕"]
    }, {"v": 16, "k2": "四兒", "gp": 2, "idf": 17, "type": ["主僕"]}, {
        "v": 4,
        "k2": "柳五",
        "gp": 2,
        "idf": 4,
        "type": ["主僕"]
    }],
    "gp": 1,
    "idf": 1578
}, {"k1": "周瑞家的", "kg2": [{"v": 1, "k2": "子興", "gp": 2, "idf": 8, "type": ["岳婿"]}], "gp": 1, "idf": 69}, {
    "k1": "玉函",
    "kg2": [{"v": 3, "k2": "襲人", "gp": 2, "idf": 469, "type": ["夫妻"]}],
    "gp": 1,
    "idf": 11
}, {"k1": "文翔", "kg2": [{"v": 4, "k2": "鴛鴦", "gp": 2, "idf": 163, "type": ["兄妹"]}], "gp": 1, "idf": 6},
    {
        "k1": "賴嬤",
        "kg2": [{"v": 4, "k2": "賴大", "gp": 2, "idf": 54, "type": ["母子"]}],
        "gp": 1,
        "idf": 7
    }, {"k1": "金釧", "kg2": [{"v": 27, "k2": "釧兒", "gp": 2, "idf": 48, "type": ["姐妹"]}], "gp": 1, "idf": 30}, {
        "k1": "賈政",
        "kg2": [{"v": 185, "k2": "寶玉", "gp": 2, "idf": 1578, "type": ["父子"]}, {
            "v": 93,
            "k2": "王夫",
            "gp": 2,
            "idf": 592,
            "type": ["夫妻"]
        }, {"v": 14, "k2": "探春", "gp": 2, "idf": 225, "type": ["父女"]}, {
            "v": 23,
            "k2": "賈環",
            "gp": 2,
            "idf": 79,
            "type": ["父子"]
        }, {"v": 1, "k2": "元春", "gp": 2, "idf": 11, "type": ["父女"]}, {
            "v": 10,
            "k2": "趙姨",
            "gp": 2,
            "idf": 84,
            "type": ["夫妻"]
        }, {"v": 4, "k2": "賈珠", "gp": 2, "idf": 7, "type": ["父子"]}],
        "gp": 1,
        "idf": 394
    }, {"k1": "吳貴", "kg2": [{"v": 3, "k2": "晴雯", "gp": 2, "idf": 156, "type": ["表兄妹"]}], "gp": 1, "idf": 4}, {
        "k1": "子騰",
        "kg2": [{"v": 13, "k2": "王夫", "gp": 2, "idf": 592, "type": ["兄妹"]}],
        "gp": 1,
        "idf": 20
    }, {"k1": "旺兒之子", "kg2": [{"v": 1, "k2": "彩霞", "gp": 2, "idf": 12, "type": ["夫妻"]}], "gp": 1, "idf": 1},
    {
        "k1": "應嘉",
        "kg2": [
            {"v": 1, "k2": "甄寶", "gp": 2, "idf": 17, "type": ["父子"]}
        ],
        "gp": 1,
        "idf": 6
    },
    {"k1": "士隱", "kg2": [{"v": 1, "k2": "香菱", "gp": 2, "idf": 93, "type": ["父女"]}], "gp": 1, "idf": 13}, {
        "k1": "守中",
        "kg2": [{"v": 1, "k2": "李紈", "gp": 2, "idf": 250, "type": ["父女"]}],
        "gp": 1,
        "idf": 1
    }, {"k1": "封肅", "kg2": [{"v": 2, "k2": "嬌杏", "gp": 2, "idf": 2, "type": ["翁婿"]}], "gp": 1, "idf": 2}, {
        "k1": "寶釵",
        "kg2": [{"v": 36, "k2": "鶯兒", "gp": 2, "idf": 46, "type": ["主僕"]}],
        "gp": 1,
        "idf": 582
    }, {"k1": "熙鳳", "kg2": [{"v": 1, "k2": "平兒", "gp": 2, "idf": 232, "type": ["主僕"]}], "gp": 1, "idf": 13}, {
        "k1": "薛蟠",
        "kg2": [{"v": 10, "k2": "香菱", "gp": 2, "idf": 93, "type": ["夫妾"]}, {
            "v": 24,
            "k2": "金桂",
            "gp": 2,
            "idf": 53,
            "type": ["夫妻"]
        }],
        "gp": 1,
        "idf": 133
    }, {"k1": "賈敬", "kg2": [{"v": 11, "k2": "賈珍", "gp": 2, "idf": 196, "type": ["父子"]}], "gp": 1, "idf": 13}, {
        "k1": "李紈",
        "kg2": [{"v": 17, "k2": "賈蘭", "gp": 2, "idf": 54, "type": ["母子"]}],
        "gp": 1,
        "idf": 250
    }, {"k1": "趙嬤", "kg2": [{"v": 3, "k2": "賈璉", "gp": 2, "idf": 346, "type": ["乳母子"]}], "gp": 1, "idf": 4}, {
        "k1": "之孝",
        "kg2": [{"v": 1, "k2": "紅玉", "gp": 2, "idf": 2, "type": ["父女"]}],
        "gp": 1,
        "idf": 61
    }, {
        "k1": "甄家",
        "kg2": [{"v": 2, "k2": "嬌杏", "gp": 2, "idf": 2, "type": ["主僕"]}, {
            "v": 3,
            "k2": "包勇",
            "gp": 2,
            "idf": 19,
            "type": ["主僕"]
        }],
        "gp": 1,
        "idf": 27
    }, {
        "k1": "趙姨",
        "kg2": [{"v": 18, "k2": "探春", "gp": 2, "idf": 225, "type": ["母女"]}, {
            "v": 22,
            "k2": "賈環",
            "gp": 2,
            "idf": 79,
            "type": ["母子"]
        }],
        "gp": 1,
        "idf": 84
    }]